{"title": "ICLR 2018 Conference Acceptance Decision", "comment": "This paper presents a novel and interesting sketch-based approach to conditional program generation. I will say upfront that it is worth of acceptance, based on its contribution and the positivity of the reviews. I am annoyed to see that the review process has not called out the authors' lack of references to the decently body of existing work on generating structure on neural sketch programming and on generating under grammatical constraint. The authors' will need look no further than the proceedings of the *ACL conferences of the last few years to find papers such as:\n* Dyer, Chris, et al. \"Recurrent Neural Network Grammars.\" Proceedings of NAACL-HLT (2016).\n* Kuncoro, Adhiguna, et al. \"What Do Recurrent Neural Network Grammars Learn About Syntax?.\" Proceedings of EACL (2016).\n* Yin, Pengcheng, and Graham Neubig. \"A Syntactic Neural Model for General-Purpose Code Generation.\" Proceedings of ACL (2017).\n* Rabinovich, Maxim, Mitchell Stern, and Dan Klein. \"Abstract Syntax Networks for Code Generation and Semantic Parsing.\" Proceedings of ACL (2017).\n\nOr other work on neural program synthesis, with sketch based methods:\n* Gaunt, Alexander L., et al. \"Terpret: A probabilistic programming language for program induction.\" arXiv preprint arXiv:1608.04428 (2016).\n* Riedel, Sebastian, Matko Bosnjak, and Tim Rocktäschel. \"Programming with a differentiable forth interpreter.\" CoRR, abs/1605.06640 (2016).\n\nLikewise the references to the non-neural program synthesis and induction literature are thin, and the work is poorly situated as a result.\n\nIt is a disappointing but mild failure of the scientific process underlying peer review for this conference that such comments were not made. The authors are encouraged to take heed of these comments in preparing their final revision, but I will not object to the acceptance of the paper on these grounds, as the methods proposed therein are truly interesting and exciting.", "decision": "Accept (Oral)"}